Revit 2027 API
BuiltInFailures.ColumnFailures.ColumnAndTargetAreConcrete Property
 Column and target are both concrete. Geometries have been joined.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ColumnAndTargetAreConcrete { get; }
Public Shared ReadOnly Property ColumnAndTargetAreConcrete As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ColumnAndTargetAreConcrete {
	FailureDefinitionId^ get ();
}
static member ColumnAndTargetAreConcrete : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ColumnFailures Class
Autodesk.Revit.DB Namespace